{
	"type":"flags",
	"title":"Flags",
	"object":"",
	"intro":[
		"Flags can be entered either in the dedicated field or directly in the input box. Some flags may be combined in the form `-mR`. When a flag runs the programme on each element in the first input and that input is a number then it is first converted to the range `[0,N)` or, if that input is a string, it is first split into an array of characters and rejoined again afterwards."
	],
	"flags":{
		"!":{
			"description":"Outputs the logical `NOT` of the value returned by the programme; i.e., `true` if falsey, or `false` if truthy.",
			"version":"1.4.5"
		},
		"E\"s\"":{
			"description":"Outputs `s` if the programme throws an error. Considered to be a \"cheating\" flag - use at your own discretion.",
			"version":"1.4.6"
		},
		"F\"s\"":{
			"description":"Outputs `s` if the programme returns a falsey value. Considered to be a \"cheating\" flag - use at your own discretion.",
			"version":"1.4.6"
		},
		"N":{
			"description":"Converts the value returned by the programme to a number. If that value is an array, it is first joined to a string.",
			"version":"1.4.5"
		},
		"P":{
			"description":"Joins the value returned by the programme to a string if that value is an array.",
			"version":"1.4.5"
		},
		"Q":{
			"description":"\"Prettyprints\" the output.",
			"version":"1.4.5"
		},
		"R":{
			"description":"Joins the value returned by the programme to a string with newlinews if that value is an array.",
			"version":"1.4.5"
		},
		"S":{
			"description":"Joins the value returned by the programme to a string with spaces if that value is an array.",
			"version":"1.4.5"
		},
		"d":{
			"description":"Runs the program on each element in the first input, outputting `true` if any returns a truthy value, or `false` if not.",
			"version":"1.4.5"
		},
		"e":{
			"description":"Runs the program on each element in the first input, outputting `true` if all return a truthy value, or `false` if not.",
			"version":"1.4.5"
		},
		"f":{
			"description":"Runs the program on each element in the first input, outputting an array of those that return a truthy value.",
			"version":"1.4.5"
		},
		"g":{
			"description":"If the programme returns a number then outputs its sign; `-1` if negative, `1` if positive, `0` if `0`, or `NaN` if `NaN`.",
			"version":"1.4.5"
		},
		"gn":{
			"description":"If the programme returns a string or an array, outputs the character or element at index `n`, with `n` defaulting to `0`.",
			"version":"1.4.5"
		},
		"h":{
			"description":"If the programme returns a string or an array, outputs the last character or element.",
			"version":"1.4.5"
		},
		"m":{
			"description":"Runs the program on each element in the first input, outputting an array of the results.",
			"version":"1.4.5"
		},
		"x":{
			"description":"Runs the `.x()` method for the relevant type on the value returned by the programme, trimming a string, reducing an array by addition, or rounding a number to the nearest whole number.",
			"version":"1.4.5"
		},
		"ยก":{
			"description":"Outputs the value returned by the programme as a boolean; i.e., `true` if truthy, or `false` if falsey.",
			"version":"1.4.5"
		},
		"รฆ":{
			"description":"Runs the program on each element in the first input, outputting the first to return a truthy value.",
			"version":"1.4.5"
		}
	}
}